# Electrical System Ground Conductor Size Property

Source: https://www.revitapidocs.com/2026/4a5296f4-064c-9298-3e19-05a6cbd87bf5.htm

---

| Electrical System Ground Conductor Size Property |
| --- |

The size of a Ground Conductor in the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId GroundConductorSize { get; }
```

```
Public ReadOnly Property GroundConductorSize As ElementId
	Get
```

```
public:
property ElementId^ GroundConductorSize {
	ElementId^ get ();
}
```

```
member GroundConductorSize : ElementId with get
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Remarks Each Ground Conductor has the same size in the Electrical System. See Also

#### Reference

ElectricalSystem Class Autodesk.Revit.DB.Electrical Namespace